#+TITLE: Dynamic modules in Emacs

This repo contains examples of creating dynamic modules for Emacs.

** GNU Scientific Library
   :PROPERTIES:
   :ID:       E88713AA-1100-49CB-8E9E-4ED8C268BA3D
   :END:

Similar to the BSON/mongoc situation it seems likely that a full dynamic module is necessary here too because of ffi limitations on custom structs.

I think getting a decent linear algebra capability with minimal broadcasting would be helpful. We can use vectors and have a generalized dot product.

It might be best to see if I can wrap Numpy for this.

#+BEGIN_SRC emacs-lisp
(dot [1 2] [3 4]) 			; a scalar

(dot [[1 1]
      [2 2]]
     [1 1]) 				; here b is implied as a column
#+END_SRC


It would be helpful to have a vector-1d-p function, and a vector size function. The vector size function should probably work recursively so you can pass an arbitrary shaped array in.

#+BEGIN_SRC emacs-lisp
(defun vector-shape (vec)
  "Return a vector of the shape of a vector."
  (let ((shape (vector (length vec))))
    (if (vectorp (aref vec 0))
	(vconcat shape (vector-shape (aref vec 0)))
      shape)))

(defun vector-ndims (vec)
  "Returns the number of dimensions in a vector."
  (length (vector-shape vec)))

(defun vector-numel (vec)
  "Returns the number of elements in a vector."
  (if (> (length vec) 0)
      (seq-reduce '* (vector-shape vec) 1)
    0))

(vector-shape [[[1 2][4 5]]])
(vector-ndims [])
(vector-numel [[1 2][3 4]])

#+END_SRC

#+RESULTS:
: 4

Broadcasting rules.

See [[id:BEAB5896-BE68-4C32-B049-CE7DD5506922][Adding linear algebra to Emacs with the GSL and dynamic modules]]

